tamaygz/esp-rollaball-derby/clients/esp8266-sensor/src/main.cpp
#include <Arduino.h>
#if defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#elif defined(ESP32)
#include <WiFi.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#else
#error "Unsupported board: define ESP8266 or ESP32 target"
#endif
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>

#include "config.h"
#include "websocket.h"
#include "sensors.h"
#include "led.h"
#include "device_info.h"

// ─── Global Instances ─────────────────────────────────────────────────────────
static WSClient        wsClient;
static Sensors         sensors;
static LedManager      ledManager;
#if defined(ESP8266)
using DerbyWebServer = ESP8266WebServer;
#else
using DerbyWebServer = WebServer;
#endif
static DerbyWebServer  httpServer(HTTP_CONFIG_PORT);

// Flag set by the /config handler so the reboot happens after the HTTP response
// has been flushed to the client.
static bool g_pendingRestart = false;

// ─── Runtime Config (loaded from LittleFS, populated by WiFiManager) ──────────
static char g_serverIp  [40] = "192.168.1.200";
static char g_serverPort[ 6] = "3000";
static char g_playerName[21] = "";

// ─── Persisted Runtime State (survives reboots) ──────────────────────────────
static char     g_playerId[48]     = "";    // UUID from server registration
static LedConfig g_savedLedConfig  = {};    // Last LED config from server
static bool     g_hasLedConfig     = false; // true once a server LED config has been saved
static bool     g_stateDirty       = false; // true when state needs to be flushed to flash
static unsigned long g_stateLastSave = 0;   // millis() of last state save
static const unsigned long STATE_SAVE_DEBOUNCE_MS = 2000; // Min interval between flash writes

// ─── WiFiManager ──────────────────────────────────────────────────────────────
static WiFiManager          wifiManager;
static WiFiManagerParameter* param_ip;
static WiFiManagerParameter* param_port;
static WiFiManagerParameter* param_name;

// ─── LittleFS Config Helpers ──────────────────────────────────────────────────

static void loadConfig() {
    if (!LittleFS.exists(CONFIG_FILE)) {
        Serial.println("[CFG] No config file — using defaults");
        return;
    }

    File f = LittleFS.open(CONFIG_FILE, "r");
    if (!f) {
        Serial.println("[CFG] Failed to open config file");
        return;
    }

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();

    if (err) {
        Serial.printf("[CFG] Parse error (%s) — using defaults\n", err.c_str());
        return;
    }

    if (doc["server_ip"  ].is<const char*>()) strlcpy(g_serverIp,   doc["server_ip"],   sizeof(g_serverIp));
    if (doc["server_port"].is<const char*>()) strlcpy(g_serverPort,  doc["server_port"], sizeof(g_serverPort));
    if (doc["player_name"].is<const char*>()) strlcpy(g_playerName,  doc["player_name"], sizeof(g_playerName));

    Serial.printf("[CFG] Loaded: ip=%s port=%s name=%s\n",
                  g_serverIp, g_serverPort, g_playerName);
}

static void saveConfig() {
    JsonDocument doc;
    doc["server_ip"  ] = g_serverIp;
    doc["server_port"] = g_serverPort;
    doc["player_name"] = g_playerName;

    File f = LittleFS.open(CONFIG_FILE, "w");
    if (!f) {
        Serial.println("[CFG] Failed to write config file");
        return;
    }

    serializeJson(doc, f);
    f.close();
    Serial.println("[CFG] Config saved");
}

// ─── Runtime State Persistence ────────────────────────────────────────────────
// Persists server-assigned state (playerId, LED config, device color) to a
// separate file so the device boots with the correct identity and LED setup.
// Uses atomic write (temp → rename) to prevent corruption on power loss.

static bool isValidStateFile(const char* path) {
    File f = LittleFS.open(path, "r");
    if (!f) {
        return false;
    }

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();

    return !err;
}

static bool isValidLedPinForPlatform(int pin) {
#if defined(ESP8266)
    // Shared LED controller supports only GPIO2/GPIO3 on ESP8266 timing methods.
    return pin == 2 || pin == 3;
#elif defined(ESP32)
    return pin >= 0 && pin <= LED_GPIO_MAX;
#else
    return false;
#endif
}

static void loadState() {
    const bool hasState = LittleFS.exists(STATE_FILE);
    const bool hasTemp  = LittleFS.exists(STATE_TMP);

    if (hasTemp) {
        if (!hasState) {
            Serial.println("[STATE] Recovering from interrupted write (temp → state)");
            LittleFS.rename(STATE_TMP, STATE_FILE);
        } else {
            const bool stateValid = isValidStateFile(STATE_FILE);
            const bool tempValid  = isValidStateFile(STATE_TMP);

            if (!stateValid && tempValid) {
                Serial.println("[STATE] Main state invalid; recovering from temp file");
                LittleFS.remove(STATE_FILE);
                LittleFS.rename(STATE_TMP, STATE_FILE);
            } else {
                Serial.println("[STATE] Removing stale temp state file");
                LittleFS.remove(STATE_TMP);
            }
        }
    }

    if (!LittleFS.exists(STATE_FILE)) {
        Serial.println("[STATE] No state file — using defaults");
        return;
    }

    File f = LittleFS.open(STATE_FILE, "r");
    if (!f) {
        Serial.println("[STATE] Failed to open state file");
        return;
    }

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();

    if (err) {
        Serial.printf("[STATE] Parse error (%s) — using defaults\n", err.c_str());
        return;
    }

    if (doc["player_id"].is<const char*>()) {
        strlcpy(g_playerId, doc["player_id"], sizeof(g_playerId));
    }

    if (doc["led_count"].is<int>()) {
        const int count = doc["led_count"].as<int>();
        const int pin   = doc["led_pin"]  | static_cast<int>(LED_DEFAULT_PIN);
        const int bri   = doc["led_brightness"] | static_cast<int>(LED_DEFAULT_BRIGHTNESS);

