tamaygz/esp-rollaball-derby/clients/esp8266-sensor/src/main.cpp
        // Validate / clamp to safe ranges — corrupted state must not brick LEDs.
        const bool isCountValid      = (count >= 1 && count <= LED_PLATFORM_MAX_LEDS);
        const bool isPinValid        = isValidLedPinForPlatform(pin);
        const bool isBrightnessValid = (bri >= 0 && bri <= 255);
        if (!isCountValid || !isPinValid || !isBrightnessValid) {
            Serial.println("[STATE] LED config out of range — ignoring saved values");
        } else {
            g_savedLedConfig.ledCount   = static_cast<uint16_t>(count);
            g_savedLedConfig.pin        = static_cast<uint8_t>(pin);
            g_savedLedConfig.brightness = static_cast<uint8_t>(bri);
            g_savedLedConfig.topology   = LedTopology::STRIP;
            g_savedLedConfig.matrixRows = 8;
            g_savedLedConfig.matrixCols = 8;

            const char* topo = doc["led_topology"] | "strip";
            if      (strcmp(topo, "ring")               == 0) g_savedLedConfig.topology = LedTopology::RING;
            else if (strcmp(topo, "matrix_zigzag")      == 0) g_savedLedConfig.topology = LedTopology::MATRIX_ZIGZAG;
            else if (strcmp(topo, "matrix_progressive") == 0) g_savedLedConfig.topology = LedTopology::MATRIX_PROGRESSIVE;

            g_hasLedConfig = true;
        }
    }

    if (doc["device_color_r"].is<int>()) {
        const int r = doc["device_color_r"] | 0;
        const int g = doc["device_color_g"] | 0;
        const int b = doc["device_color_b"] | 0;

        if (r >= 0 && r <= 255 && g >= 0 && g <= 255 && b >= 0 && b <= 255) {
            g_savedLedConfig.deviceColorR   = static_cast<uint8_t>(r);
            g_savedLedConfig.deviceColorG   = static_cast<uint8_t>(g);
            g_savedLedConfig.deviceColorB   = static_cast<uint8_t>(b);
            g_savedLedConfig.hasDeviceColor = true;
        } else {
            Serial.println("[STATE] Device color out of range — ignoring");
        }
    }

    Serial.printf("[STATE] Loaded: playerId=%s ledCount=%u hasColor=%d\n",
                  g_playerId,
                  g_hasLedConfig ? g_savedLedConfig.ledCount : 0,
                  g_savedLedConfig.hasDeviceColor ? 1 : 0);
}

static void saveState() {
    JsonDocument doc;

    if (strlen(g_playerId) > 0) {
        doc["player_id"] = g_playerId;
    }

    if (g_hasLedConfig) {
        doc["led_count"]      = g_savedLedConfig.ledCount;
        doc["led_pin"]        = g_savedLedConfig.pin;
        doc["led_brightness"] = g_savedLedConfig.brightness;

        const char* topo = "strip";
        switch (g_savedLedConfig.topology) {
            case LedTopology::RING:               topo = "ring"; break;
            case LedTopology::MATRIX_ZIGZAG:      topo = "matrix_zigzag"; break;
            case LedTopology::MATRIX_PROGRESSIVE:  topo = "matrix_progressive"; break;
            default: break;
        }
        doc["led_topology"] = topo;
    }

    if (g_savedLedConfig.hasDeviceColor) {
        doc["device_color_r"] = g_savedLedConfig.deviceColorR;
        doc["device_color_g"] = g_savedLedConfig.deviceColorG;
        doc["device_color_b"] = g_savedLedConfig.deviceColorB;
    }

    // Atomic write: write to temp file, then rename to avoid corruption.
    File f = LittleFS.open(STATE_TMP, "w");
    if (!f) {
        Serial.println("[STATE] Failed to write temp state file");
        return;
    }
    serializeJson(doc, f);
    f.close();

    // Remove old state file (ignore failure — it may not exist on first write).
    LittleFS.remove(STATE_FILE);
    if (!LittleFS.rename(STATE_TMP, STATE_FILE)) {
        Serial.println("[STATE] WARNING: rename failed — temp file remains");
        return;
    }

    g_stateDirty     = false;
    g_stateLastSave  = millis();
    Serial.println("[STATE] State saved");
}

// Mark state as dirty; actual write is debounced in loop().
static void markStateDirty() {
    g_stateDirty = true;
}

// Flush state to flash if dirty and debounce period has elapsed.
static void flushStateIfNeeded() {
    if (!g_stateDirty) return;
    unsigned long now = millis();
    if (now - g_stateLastSave >= STATE_SAVE_DEBOUNCE_MS) {
        saveState();
    }
}

// ─── mDNS Server Discovery ────────────────────────────────────────────────────
// Queries the LAN for _derby._tcp to auto-discover the game server.
// Returns true and fills host/port on success; false if no service found.

static bool discoverServer(String& host, uint16_t& port) {
    // Build a unique mDNS hostname: "derby-sensor-XXXX"
    char mdnsName[32];
    snprintf(mdnsName, sizeof(mdnsName), "derby-sensor-%04x", derbyChipSuffix16());

    if (!MDNS.begin(mdnsName)) {
        Serial.println("[mDNS] Failed to start responder");
        return false;
    }

    Serial.println("[mDNS] Querying for _derby._tcp ...");
    int n = MDNS.queryService("derby", "tcp");
    if (n <= 0) {
        Serial.println("[mDNS] No server found — falling back to config");
        return false;
    }

    // Pick the first result on the same subnet as the ESP32's WiFi interface.
    // Windows hosts can advertise mDNS from multiple adapters (e.g. WSL2 bridge),
    // so we must reject IPs that are unreachable from the sensor's subnet.
    IPAddress localIp = WiFi.localIP();
    IPAddress mask    = WiFi.subnetMask();

    // On ESP32, subnetMask() can return 0.0.0.0 immediately after connect while
    // DHCP is still settling. Fall back to /24 — covers virtually all home/office
    // networks and is enough to distinguish 192.168.x.x from 172.x.x.x.
    if ((uint32_t)mask == 0) {
        mask = IPAddress(255, 255, 255, 0);
        Serial.printf("[mDNS] Subnet mask not ready — assuming /24 (local IP: %s)\n",
                      localIp.toString().c_str());
    }

    uint32_t myNet = (uint32_t)localIp & (uint32_t)mask;
    Serial.printf("[mDNS] Local: %s  mask: %s  net: %d.%d.%d.%d  candidates: %d\n",
                  localIp.toString().c_str(), mask.toString().c_str(),
                  (myNet >> 24) & 0xFF, (myNet >> 16) & 0xFF,
                  (myNet >> 8) & 0xFF, myNet & 0xFF, n);

