tamaygz/esp-rollaball-derby/clients/esp8266-sensor/src/main.cpp
    wifiManager.addParameter(param_ip);
    wifiManager.addParameter(param_port);
    wifiManager.addParameter(param_name);
    wifiManager.setSaveParamsCallback(onSaveParams);

    // If no saved credentials, open the captive-portal AP for 3 minutes.
    // If credentials are saved, connect automatically without opening the portal.
    wifiManager.setConfigPortalTimeout(180);

    Serial.printf("[WiFi] Auto-connecting (AP: %s if needed)\n", apName);
    if (!wifiManager.autoConnect(apName)) {
        // autoConnect() returns false on timeout; reboot and try again.
        Serial.println("[WiFi] autoConnect timed out — rebooting");
        ESP.restart();
    }

    Serial.printf("[WiFi] Connected — IP: %s\n", WiFi.localIP().toString().c_str());
    ledManager.setState(LedState::WIFI_ONLY);

    // Try mDNS autodiscovery first; fall back to stored config.
    String discoveredHost;
    uint16_t discoveredPort;
    if (discoverServer(discoveredHost, discoveredPort)) {
        wsClient.begin(discoveredHost.c_str(), discoveredPort, g_playerName, g_playerId);
    } else {
        uint16_t port = static_cast<uint16_t>(atoi(g_serverPort));
        wsClient.begin(g_serverIp, port, g_playerName, g_playerId);
    }

    // HTTP config server — lets the Node.js admin push new config without
    // needing to re-open the WiFiManager captive portal.
    httpServer.on("/config", handleHttpConfig);
    httpServer.begin();
    Serial.printf("[HTTP] Config server listening on port %d\n", HTTP_CONFIG_PORT);
}

// ─── Loop ─────────────────────────────────────────────────────────────────────

static bool s_wifiWasConnected = false;

void loop() {
    ledManager.loop();

    bool wifiOk = (WiFi.status() == WL_CONNECTED);

    if (!wifiOk) {
        if (s_wifiWasConnected) {
            s_wifiWasConnected = false;
            wsClient.onWiFiLost();
            Serial.println("[WiFi] Connection lost");
        }
        ledManager.setState(LedState::NO_WIFI);
        return;
    }

    if (!s_wifiWasConnected) {
        s_wifiWasConnected = true;
        Serial.printf("[WiFi] Reconnected — IP: %s\n", WiFi.localIP().toString().c_str());

        // Re-attempt mDNS discovery after WiFi reconnect in case server IP changed.
        String rediscoveredHost;
        uint16_t rediscoveredPort;
        if (discoverServer(rediscoveredHost, rediscoveredPort)) {
            wsClient.begin(rediscoveredHost.c_str(), rediscoveredPort, g_playerName, g_playerId);
        }
    }

#if defined(ESP8266)
    MDNS.update();
#endif
    httpServer.handleClient();

    // Reboot after the HTTP response has been flushed (flagged by handleHttpConfig).
    if (g_pendingRestart) {
        // Flush any pending state before restarting.
        if (g_stateDirty) saveState();
        delay(200);
        ESP.restart();
    }

    wsClient.loop();

    // ── Persist playerId when assigned/changed ───────────────────────────────
    {
        const String& currentId = wsClient.getPlayerId();
        if (currentId.length() > 0 && strcmp(g_playerId, currentId.c_str()) != 0) {
            strlcpy(g_playerId, currentId.c_str(), sizeof(g_playerId));
            markStateDirty();
            Serial.printf("[STATE] playerId changed: %s\n", g_playerId);
        }
    }

    // ── LED config hot-reload ────────────────────────────────────────────────
    LedConfig pendingCfg;
    if (wsClient.pollLedConfig(pendingCfg)) {
        ledManager.applyConfig(pendingCfg);
        wsClient.setLedMetadata(pendingCfg.ledCount);
        // Persist the LED config so next boot starts with the correct setup.
        g_savedLedConfig = pendingCfg;
        g_hasLedConfig   = true;
        markStateDirty();
    }

    // ── LED test effect ──────────────────────────────────────────────────────
    LedTestEffectMessage pendingEffect;
    if (wsClient.pollTestEffect(pendingEffect)) {
        ledManager.playTestEffect(pendingEffect);
    }

    int points          = sensors.check();
    LocalEventType  lev = wsClient.pollLocalEvent();
    GlobalEventType gev = wsClient.pollGlobalEvent();

    if (wsClient.isConnected()) {
        ledManager.setState(LedState::WS_CONNECTED);

        // Global events: all devices react (countdown, lifecycle, winner).
        bool winnerEvent = false;
        switch (gev) {
            case GlobalEventType::COUNTDOWN_TICK: ledManager.onGlobalEvent(gev); break;
            case GlobalEventType::GAME_STARTED:   ledManager.onGlobalEvent(gev); break;
            case GlobalEventType::GAME_PAUSED:    ledManager.onGlobalEvent(gev); break;
            case GlobalEventType::GAME_RESUMED:   ledManager.onGlobalEvent(gev); break;
            case GlobalEventType::GAME_RESET:     ledManager.onGlobalEvent(gev); break;
            case GlobalEventType::WINNER_SELF:    ledManager.onGlobalEvent(gev); winnerEvent = true; break;
            case GlobalEventType::WINNER_OTHER:   ledManager.onGlobalEvent(gev); winnerEvent = true; break;
            default: break;
        }

        // Device-local events: only the owning device reacts (scoring, rank, streaks).
        // Skip when a winner event fired — the winning score arrives in the same
        // WS batch and would immediately overwrite the rainbow/pulse effect.
        if (winnerEvent) lev = LocalEventType::NONE;
        switch (lev) {
            case LocalEventType::SCORE_PLUS1:   ledManager.onLocalEvent(lev); break;
            case LocalEventType::SCORE_PLUS2:   ledManager.onLocalEvent(lev); break;
            case LocalEventType::SCORE_PLUS3:   ledManager.onLocalEvent(lev); break;
            case LocalEventType::ZERO_ROLL:     ledManager.onLocalEvent(lev); break;
            case LocalEventType::TOOK_LEAD:     ledManager.onLocalEvent(lev); break;
            case LocalEventType::BECAME_LAST:   ledManager.onLocalEvent(lev); break;
            case LocalEventType::STREAK_ZERO:   ledManager.onLocalEvent(lev); break;
            case LocalEventType::STREAK_THREE:  ledManager.onLocalEvent(lev); break;
            default: break;
        }

        // Only send score events once a playerId has been assigned by the server.
        if (!wsClient.getPlayerId().isEmpty()) {
            if (points > 0) {
                Serial.printf("[SENSOR] Triggered: +%d\n", points);
                wsClient.sendScore(points);
            }
        } else if (points > 0) {
            Serial.printf("[SENSOR] Dropped trigger while waiting for player assignment: +%d\n", points);
        }
    } else {
        ledManager.setState(LedState::WIFI_ONLY);
        if (points > 0) {
            Serial.printf("[SENSOR] Dropped offline trigger: +%d\n", points);
        }
    }

    // ── Debounced state flush to LittleFS ────────────────────────────────────
    flushStateIfNeeded();
}
